-- Вставка данных в таблицу credit_condition
INSERT INTO public.credit_condition (min_amount, max_amount, interest_rate, term_min, term_max, product_name)
VALUES
    (100000, 500000, 15.50, 12, 60, 'Потребительский кредит'),
    (500000, 10000000, 8.00, 120, 360, 'Ипотека'),
    (300000, 3000000, 9.50, 24, 84, 'Автокредит'),
    (100000, 5000000, 12.00, 12, 120, 'Бизнес-кредит'),
    (50000, 500000, 7.00, 6, 120, 'Образовательный кредит'),
    (50000, 500000, 14.00, 12, 60, 'Кредит на ремонт'),
    (200000, 4000000, 5.00, 12, 120, 'Агрокредит'),
    (10000, 200000, 20.00, 6, 36, 'Кредит на технику');

-- Вставка данных в таблицу role
INSERT INTO public.role (name)
VALUES
    ('ROLE_CLIENT'),
    ('ROLE_CREDIT_OFFICER'),
    ('ROLE_DIRECTOR');